In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        "A": [4,5,6],
        "B": [7,8,9],
        "C": [10,11,12]
    },
    index=[1,2,3]
)

df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

In [3]:
df = pd.DataFrame( {
    "Name": ["Neha", "Gauri", "Sakshi"],
    "Age": [25,30,35],
    "Location": ["Nagar", "Nashik", "Pune"]
    
},
    index=[1,2,3]
)

In [4]:
df

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [5]:
df.head()

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [6]:
df.tail()

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [7]:
df.shape

(3, 3)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 72.0+ bytes

In [9]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [10]:
df['Age'].max()

np.int64(35)

In [11]:
df['Age'].min()

np.int64(25)

In [12]:
df['Age'].mean()

np.float64(30.0)

In [13]:
df.drop_duplicates()

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [16]:
df = pd.DataFrame( {
    "Name": ["Neha", "Gauri", "Sakshi", "Gita"],
    "Age": [25,30,35,25],
    "Location": ["Nagar", "Nashik", "Pune", "Seattle"]
    
},
    index=[1,2,3,4]
  )

In [17]:
df

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune
4    Gita   25  Seattle

In [18]:
df.drop_duplicates()

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune
4    Gita   25  Seattle

In [19]:
df.loc[1]

Name         Neha
Age            25
Location    Nagar
Name: 1, dtype: object

In [20]:
df.iloc[0:]

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune
4    Gita   25  Seattle

In [21]:
df.drop(4)

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [22]:
df.drop(4)

     Name  Age Location
1    Neha   25    Nagar
2   Gauri   30   Nashik
3  Sakshi   35     Pune

In [23]:
df[df.Age < 30]

   Name  Age Location
1  Neha   25    Nagar
4  Gita   25  Seattle

In [24]:
df.isnull()

    Name    Age  Location
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False